[
  {
    "id": 1,
    "title": "Securing Critical Infrastructure for Energy Provider",
    "clientName": "Northeast Energy Corporation",
    "industry": "Energy",
    "challenge": "Northeast Energy Corporation faced growing cybersecurity threats targeting their operational technology (OT) systems. They needed to secure legacy SCADA systems while maintaining 24/7 operational reliability for 5 million customers.",
    "solution": "Cygint deployed our specialized OT security platform with passive monitoring capabilities. We created custom security controls for their unique industrial systems and implemented an air-gapped security operations center.",
    "results": "Detected and prevented a potential ransomware attack that targeted industrial control systems. Reduced security incidents by 76% in the first year. Achieved regulatory compliance with zero operational disruptions.",
    "imageUrl": "/case-studies/energy.svg",
    "tags": ["Energy", "OT Security", "Critical Infrastructure"],
    "featured": "true",
    "createdAt": "2025-03-01T00:00:00.000Z"
  },
  {
    "id": 2,
    "title": "Healthcare Provider Secures Patient Data and Medical Devices",
    "clientName": "MediCare Systems",
    "industry": "Healthcare",
    "challenge": "MediCare Systems struggled with securing a complex network of medical IoT devices across 50+ healthcare facilities. They needed visibility into thousands of connected medical devices while ensuring HIPAA compliance and minimal disruption to patient care.",
    "solution": "Cygint deployed its attack surface management platform with specialized healthcare configurations. We integrated with their existing security tools and implemented a non-intrusive scanning protocol safe for medical devices.",
    "results": "Discovered 340+ previously unknown connected devices. Implemented security controls that reduced data breach risk by 68%. Automated compliance reporting saved 20+ hours of staff time weekly.",
    "imageUrl": "/case-studies/healthcare.svg",
    "tags": ["Healthcare", "IoT Security", "Compliance"],
    "featured": "true",
    "createdAt": "2025-03-02T00:00:00.000Z"
  }
]